database = {
	// italy
	girlandaio: {
		name: "Доменико Гирландайо",
		lifetime: "2 июня 1448 — 11 января 1494.",
		bio: "Один из ведущих флорентийских художников Кватроченто, основатель художественной династии, которую продолжили его брат \
		Давид и сын Ридольфо. Глава художественной мастерской, где юный Микеланджело в течение года овладевал профессиональными навыками. \
		Автор фресковых циклов, в которых выпукло, со всевозможными подробностями показана домашняя жизнь библейских персонажей \
		(в их роли выступают знатные граждане Флоренции в костюмах того времени).",
		desktopImage: "img/catalog/girlandaio-desktop.jpg",
		tabletImage: "img/catalog/girlandaio-tablet.jpg",
		mobileImage: "img/catalog/girlandaio-mobile.jpg"
	},
	verrocchio: {
		name: "Андреа Верроккьо",
		lifetime: "1435 — 10 октября 1488.",
		bio: "Андреа дель Верроккьо, наст. имя Андреа ди Микеле Чони — скульптор и живописец эпохи Возрождения, представитель Флорентийской школы. \
		Среди его учеников — Сандро Боттичелли, Пьетро Перуджино, Леонардо да Винчи и Лоренцо ди Креди.",
		desktopImage: "img/catalog/verrocchio-desktop.jpg",
		tabletImage: "img/catalog/verrocchio-tablet.jpg",
		mobileImage: "img/catalog/verrocchio-mobile.jpg"
	},
	bergognone: {
		name: "Амброджо Бергоньоне",
		lifetime: "1453 — 1523.",
		bio: "Амброджо Бергоньоне или Боргоньоне, настоящее имя — Амброджо да Фоссано — итальянский художник ломбардской школы. \
		Прозвище говорит о его тяготении к бургундской школе, по манере ему близок Винченцо Фоппа. Испытал влияние Леонардо да Винчи. \
		Наиболее известен работами 1486—1494 в монастырской обители картезианцев Чертоза ди Павия. Позднее работал в Милане в базилике \
		Сант-Эусторджо и церкви Сан-Сатиро, после 1497 — в Лоди, в 1512 — в Бергамо, незадолго до смерти — снова в Милане, в базилике Сан-Симпличано. \
		Его завещание датировано 4 апреля 1523, в том же году он умер. Одним из его учеников считают Бернардино Луини.",
		desktopImage: "img/catalog/bergognone-desktop.jpg",
		tabletImage: "img/catalog/bergognone-tablet.jpg",
		mobileImage: "img/catalog/bergognone-mobile.jpg"
	},
	diBindo: {
		name: "Бенедетто ди Биндо",
		lifetime: "1380—85 — 19 сентября 1417.",
		bio: "Бенедетто ди Биндо — итальянский художник сиенской школы. Бенедетто ди Биндо остался в истории искусства как сиенский художник, \
		так сказать, «второго ряда», несмотря на то, что за свою короткую жизнь он выполнил ряд весьма престижных заказов, включая работы в \
		Сиенском соборе (работы в главном соборе республики второстепенным художникам не поручались). Обучение он прошёл у Таддео ди Бартоло, \
		крупного сиенского мастера поздней готики, в боттеге которого Бенедетто трудился вместе с Грегорио ди Чекко. Наибольшее влияние \
		на его творчество оказали работы Симоне Мартини, в частности в выборе колорита, а тонко проработанные лица его персонажей \
		напоминают произведения Джованни да Милано.",
		desktopImage: "img/catalog/diBindo-desktop.jpg",
		tabletImage: "img/catalog/diBindo-tablet.jpg",
		mobileImage: "img/catalog/diBindo-mobile.jpg"
	},
	giorgione: {
		name: "Джорджоне",
		lifetime: "1477/1478 — 1510",
		bio: "Джорджо Барбарелли да Кастельфранко, более известный как Джорджоне — итальянский художник, представитель венецианской школы живописи; \
		один из величайших мастеров Высокого Возрождения.",
		desktopImage: "img/catalog/giorgione-desktop.jpg",
		tabletImage: "img/catalog/giorgione-tablet.jpg",
		mobileImage: "img/catalog/giorgione-mobile.jpg"
	},
	parentino: {
		name: "Бернардо Парентино",
		lifetime: "1450 — 1500",
		bio: "Бернардо Парентино — итальянский художник эпохи Ренессанса. В основном работал в Падуе. Родился в городе Паренцо, \
		принадлежащем венецианской республике и находящимся на побережье полуострова Истрия. Там же, вероятнее всего, получил начальное образование. \
		Умер в городе Виченца. Испытал сильное влияние, а возможно и был учеником Андреа Мантеньи. Также художник известен под именами Бернардо Паренцано, \
		Бернардо да Паренцо, Бернардино Парентино. Ошибочно отождествлялся с августинским монахом Лоренцо.",
		desktopImage: "img/catalog/parentino-desktop.jpg",
		tabletImage: "img/catalog/parentino-tablet.jpg",
		mobileImage: "img/catalog/parentino-mobile.jpg"
	},
	caravaggio: {
		name: "Караваджо",
		lifetime: "29 сентября 1571 — 18 июля 1610",
		bio: "Микеланджело Меризи да Караваджо — итальянский художник, реформатор европейской живописи XVII века, основатель реализма в живописи, \
		один из крупнейших мастеров барокко. Одним из первых применил манеру письма «кьяроскуро» — резкое противопоставление света и тени, а также «тенеброcсо». \
		Не обнаружено ни одного рисунка или эскиза, художник свои сложные композиции сразу реализовывал на холсте.",
		desktopImage: "img/catalog/caravaggio-desktop.jpg",
		tabletImage: "img/catalog/caravaggio-tablet.jpg",
		mobileImage: "img/catalog/caravaggio-mobile.jpg"
	},
	michelangelo: {
		name: "Микеланджело",
		lifetime: "6 марта 1475 — 18 февраля 1564",
		bio: "Микеланджело Буонарроти, полное имя Микеланджело ди Лодовико ди Леонардо ди Буонарроти Симони — итальянский скульптор, художник, архитектор, поэт и мыслитель. \
		Один из крупнейших мастеров эпохи Возрождения и раннего барокко. Его произведения считались наивысшими достижениями искусства Возрождения ещё при жизни самого мастера. \
		Микеланджело прожил почти 89 лет, целую эпоху, от периода Высокого Возрождения к истокам Контрреформации. За этот период сменилось тринадцать пап римских — \
		он выполнял заказы для девяти из них. Сохранилось много документов о его жизни и творчестве — свидетельства современников, письма самого Микеланджело, \
		договоры, его личные и профессиональные записи. Микеланджело также был первым представителем западноевропейского искусства, чья биография была напечатана ещё при его жизни.",
		desktopImage: "img/catalog/michelangelo-desktop.jpg",
		tabletImage: "img/catalog/michelangelo-tablet.jpg",
		mobileImage: "img/catalog/michelangelo-mobile.jpg"
	},
	raffael: {
		name: "Рафаэль",
		lifetime: "6 апреля 1483 — 6 апреля 1520",
		bio: "Рафаэль Санти — итальянский живописец, график и архитектор умбрийской, а затем римской, школы. Один из ярчайших представителей искусства эпохи Высокого Возрождения, \
		или римского классицизма начала XVI века. За свою недолгую жизнь он стал одним из самых прославленных и богатых художников Италии. В своих произведениях Рафаэль воплотил \
		представление о возвышенных идеалах ренессансного гуманизма. Его картина «Сикстинская Мадонна» является одной из самых узнаваемых в истории, она являлась вдохновительницей \
		и любимым полотном русского писателя Фёдора Достоевского.",
		desktopImage: "img/catalog/raffael-desktop.jpg",
		tabletImage: "img/catalog/raffael-tablet.jpg",
		mobileImage: "img/catalog/raffael-mobile.jpg"
	},
	carracci: {
		name: "Аннибале Карраччи",
		lifetime: "3 ноября 1560 — 15 июля 1609",
		bio: "Аннибале Карраччи — итальянский живописец и гравёр болонской школы, брат художника Агостино Карраччи. Достоинства живописных произведений \
		Карраччи состоят в искусстве композиции, в умно рассчитанном размещении фигур и в свежести колорита. Однако критики отмечают также отсутствие в его \
		работах действительного, непосредственного вдохновения. Религиозные композиции Аннибале Карраччи являются точным отражением сентиментальной и \
		неискренней набожности его времени. Кроме картин духовного, мифологического и аллегорического содержания, писал также пейзажи.",
		desktopImage: "img/catalog/carracci-desktop.jpg",
		tabletImage: "img/catalog/carracci-tablet.jpg",
		mobileImage: "img/catalog/carracci-mobile.jpg"
	},
	fetti: {
		name: "Доменико Фетти",
		lifetime: "1589 — 1623",
		bio: "Доменико Фетти — итальянский художник эпохи барокко. Сын малоизвестного живописца Пьетро Фетти. Учился в Риме у Чиголи, был знаком с Эльсхаймером, \
		творчество которого оказало большое влияние на манеру Фетти. С 1613 года до 1621—1622 жил в Мантуе, где был придворным живописцем герцога Фердинандо I Гонзага. \
		В его мастерской работал и отец художника Пьетро, и его сестра Люкрина Фетти, художница и монахиня. В Мантуе Доменико Фетти написал свои самые знаменитые произведения, \
		в результате чего получил прозвище «Мантуанец». Он создал много алтарных образов и станковых картин на мифологические и библейские сюжеты. \
		Для украшения дворца герцога был написан цикл полотен на сюжеты из евангельских притч. Художник писал для монастыря Святой Урсулы, который в 1603 \
		году основала супруга герцога Маргарита Гонзага.",
		desktopImage: "img/catalog/fetti-desktop.jpg",
		tabletImage: "img/catalog/fetti-tablet.jpg",
		mobileImage: "img/catalog/fetti-mobile.jpg"
	},
	reni: {
		name: "Гвидо Рени",
		lifetime: "4 ноября 1575 — 18 августа 1642",
		bio: "Гвидо Рени — итальянский живописец болонской школы. В первый период своей деятельности Рени примкнул к господствовавшему тогда в итальянской \
		живописи натуралистическому направлению, причём, подобно другим ученикам Карраччи, подпал в сильной степени под влияние Караваджо. \
		Натуралистическое стремление Рени особенно ярко выразилось в ватиканском «Распятии», по своей концепции и по типам фигур очень схожем с изображениями пыток, \
		обычными у итальянских художников того времени. К числу произведений Рени в том же роде относится, сверх «Избиения младенцев», о котором упомянуто выше, \
		картина берлинского музея «Св. Антоний и Павел отшельники». В среднюю пору своего творчества Рени старался передавать более тёплое и нежное чувство и \
		достигать красоты и грациозности, как, например, в «Авроре» палаццо Роспильози. В последний период своего он изображал типы чисто внешней женской красоты, \
		причём придавал своим красавицам чересчур мягкие расплывчатые формы; колорит Рени прежде весьма свежий и яркий, в эту пору упадка его таланта стал тусклым и бледным.",
		desktopImage: "img/catalog/reni-desktop.jpg",
		tabletImage: "img/catalog/reni-tablet.jpg",
		mobileImage: "img/catalog/reni-mobile.jpg"
	},
	// france
	monet: {
		name: "Клод Моне",
		lifetime: "14 ноября 1840 — 5 декабря 1926.",
		bio: "Оскар Клод Моне — французский живописец, один из основателей импрессионизма. Оскар Клод Моне родился 14 ноября 1840 года в Париже. \
		Он был вторым ребёнком бакалейщика Клода Адольфа Моне и Луизы Жюстины (урождённой Обре). Когда мальчику было пять лет, семья \
		переехала в Нормандию, в Гавр. Отец хотел, чтобы Клод стал бакалейщиком и продолжил семейное дело. Юность Моне, как он сам отмечал впоследствии, \
		по существу, была юностью бродяги. Он проводил больше времени в воде и на скалах, чем в классе. Школа ему, по натуре недисциплинированному, \
		всегда казалась тюрьмой. Он развлекался, разрисовывая голубые обложки тетрадей, и использовал их для портретов своих учителей, сделанных в \
		весьма непочтительной, карикатурной манере, и в этой забаве вскоре достиг совершенства. В пятнадцать лет Моне был известен всему Гавру как карикатурист.",
		desktopImage: "img/catalog/monet-desktop.jpg",
		tabletImage: "img/catalog/monet-tablet.jpg",
		mobileImage: "img/catalog/monet-mobile.jpg"
	},
	manet: {
		name: "Эдуард Мане",
		lifetime: "23 января 1832 — 30 апреля 1883.",
		bio: "Эдуард Мане — французский живописец, гравёр, один из родоначальников импрессионизма. Эдуард Мане родился в доме 5 по улице Бонапарта \
		в парижском квартале Сен-Жермен-де-Пре в семье Огюста Мане, главы департамента Министерства юстиции, и Эжени-Дезире Фурнье, дочери французского \
		дипломата, бывшего консулом в Гётеборге. Шведский король Карл XIII был крёстным отцом матери Мане. В 1839 году Мане отдан на обучение в пансион \
		аббата Пуалу, затем по причине абсолютного равнодушия к учёбе был переведён отцом «на полный пансион» в колле́ж Роллена (фр.), где и обучался в \
		период с 1844 по 1848 год, также не проявляя никаких успехов.",
		desktopImage: "img/catalog/manet-desktop.jpg",
		tabletImage: "img/catalog/manet-tablet.jpg",
		mobileImage: "img/catalog/manet-mobile.jpg"
	},
	duchamp: {
		name: "Марсель Дюшан",
		lifetime: "28 июля 1887 — 2 октября 1968.",
		bio: "Марсель Дюшан — французский и американский художник, шахматист, теоретик искусства, стоявший у истоков дадаизма и сюрреализма. \
		Творческое наследие относительно невелико, однако благодаря оригинальности своих идей Дюшан считается одной из самых влиятельных фигур в искусстве XX века. \
		Его творчество оказало влияние на формирование таких направлений в искусстве второй половины XX века, как поп-арт, минимализм, концептуальное искусство, и др.",
		desktopImage: "img/catalog/duchamp-desktop.jpg",
		tabletImage: "img/catalog/duchamp-tablet.jpg",
		mobileImage: "img/catalog/duchamp-mobile.jpg"
	},
	picasso: {
		name: "Пабло Пикассо",
		lifetime: "25 октября 1881 — 8 апреля 1973.",
		bio: "Пабло Руис-и-Пикассо, полное имя — Пабло Диего Хосе Франсиско де Паула Хуан Непомусено Мария де лос Ремедиос Сиприано де ла Сантисима Тринидад Мартир \
		Патрисио Руис и Пикассо — испанский и французский художник, скульптор, график, театральный художник, керамист и дизайнер. \
		Основоположник кубизма (совместно с Жоржем Браком и Хуаном Грисом), в котором трёхмерное тело в оригинальной манере изображалось как ряд совмещённых воедино \
		плоскостей. Пикассо много работал как график, скульптор, керамист и т. д. Вызвал к жизни массу подражателей и оказал исключительное влияние на развитие \
		изобразительного искусства в XX веке. Согласно оценке Музея современного искусства (Нью-Йорк), Пикассо за свою жизнь создал около 20 тысяч работ. \
		По экспертным оценкам, Пикассо — самый «дорогой» художник в мире: в 2008 году объём только официальных продаж его работ составил 262 млн долларов. \
		Картина Пикассо «Алжирские женщины», проданная весной 2015 года в Нью-Йорке за 179 млн долларов, стала самой дорогой картиной, \
		когда-либо проданной с аукциона. По результатам опроса 1,4 млн читателей, проведённого газетой The Times в 2009 году, Пикассо — лучший художник среди \
		живших за последние 100 лет. Также его полотна занимают первое место по «популярности» среди похитителей.",
		desktopImage: "img/catalog/picasso-desktop.jpg",
		tabletImage: "img/catalog/picasso-tablet.jpg",
		mobileImage: "img/catalog/picasso-mobile.jpg"
	},
	// germany
	durer: {
		name: "Альбрехт Дюрер",
		lifetime: "21 мая 1471 — 6 апреля 1528.",
		bio: "Альбрехт Дюрер — немецкий живописец, гравёр и график, один из величайших мастеров западноевропейского Ренессанса. \
		Признан крупнейшим европейским мастером ксилографии, поднявшим её на уровень настоящего искусства. Первый теоретик \
		искусства среди североевропейских художников, автор практического руководства по изобразительному и декоративно-прикладному \
		искусству на немецком языке, пропагандировавший необходимость разностороннего развития художников. Основоположник сравнительной антропометрии. \
		Помимо перечисленного оставил заметный след в военно-инженерном деле разработкой теории фортификации. \
		Первый из европейских художников, написавший автобиографию.",
		desktopImage: "img/catalog/durer-desktop.jpg",
		tabletImage: "img/catalog/durer-tablet.jpg",
		mobileImage: "img/catalog/durer-mobile.jpg"
	},
	// russia
	aivazovsky: {
		name: "Иван Айвазовский",
		lifetime: "17 июля 1817 — 19 апреля 1900.",
		bio: "Иван Константинович Айвазовский — русский художник-маринист и баталист армянского происхождения, коллекционер, меценат. \
		Живописец Главного Морского штаба, действительный тайный советник, академик и почётный член Императорской Академии художеств, \
		почётный член Академий художеств в Амстердаме, Риме, Париже, Флоренции и Штутгарте. Наиболее выдающийся художник армянского происхождения XIX века. \
		Брат армянского историка и архиепископа Армянской Апостольской Церкви Габриэла Айвазовского. Будучи художником с мировой известностью, \
		Иван Константинович Айвазовский предпочитал жить и работать на своей родине — в Крыму. Айвазовский наиболее известен своими морскими пейзажами, \
		которые составляют больше половины его работ. Художник считается одним из величайших маринистов всех времён.",
		desktopImage: "img/catalog/aivazovsky-desktop.jpg",
		tabletImage: "img/catalog/aivazovsky-tablet.jpg",
		mobileImage: "img/catalog/aivazovsky-mobile.jpg"
	},
	brullov: {
		name: "Карл Брюллов",
		lifetime: "12 декабря 1799 — 11 июня 1852.",
		bio: "Карл Павлович Брюллов — русский художник, живописец, монументалист, акварелист, представитель классицизма и романтизма. \
		Автор жанровых и исторических полотен. Творчество К. П. Брюллова стало вершиной позднего русского романтизма, когда чувство гармонической \
		цельности и красоты мира сменилось ощущением трагизма и конфликтности жизни, интересом к сильным страстям, необычайным темам и ситуациям. \
		На первый план вновь выдвигается историческая картина, но теперь её главная тема — не борьба героев, как в классицизме, а судьбы огромных человеческих масс. \
		В своем центральном произведении «Последний день Помпеи» Брюллов соединил драматизм действия, романтические эффекты освещения и скульптурную, \
		классически совершенную пластику фигур. Картина принесла художнику огромную известность как в России, так и в Европе.",
		desktopImage: "img/catalog/brullov-desktop.jpg",
		tabletImage: "img/catalog/brullov-tablet.jpg",
		mobileImage: "img/catalog/brullov-mobile.jpg"
	},
	kandinsky: {
		name: "Василий Кандинский",
		lifetime: "4 декабря 1866 — 13 декабря 1944.",
		bio: "Василий Васильевич Кандинский — русский художник и теоретик изобразительного искусства, стоявший у истоков абстракционизма. Один из основателей \
		группы «Синий всадник». Дядя философа Александра Кожева. Карьеру художника Кандинский выбрал сравнительно поздно — в возрасте 30 лет. \
		Во многом это произошло под влиянием выставки импрессионистов, прошедшей в Москве в 1895 году (и в частности, под впечатлением от картины Клода Моне «Стог сена»). \
		В ноябре 1895 года он написал своему научному руководителю А. И. Чупрову, что «решил оставить занятия наукой. <…> И чем дальше идёт время, тем сильнее притягивает \
		меня к себе старая и прежде безнадёжная любовь к живописи». В 1896 году Кандинский отказался от предложенного Дерптским университетом места \
		приват-доцента и уехал в Мюнхен, чтобы учиться живописи.",
		desktopImage: "img/catalog/kandinsky-desktop.jpg",
		tabletImage: "img/catalog/kandinsky-tablet.jpg",
		mobileImage: "img/catalog/kandinsky-mobile.jpg"
	},
	malevich: {
		name: "Казимир Малевич",
		lifetime: "11 февраля 1879 — 15 мая 1935.",
		bio: "Казимир Северинович Малевич — российский и советский художник-авангардист польского происхождения, педагог, теоретик искусства, философ. \
		Основоположник супрематизма — одного из крупнейших направлений абстракционизма. Детские годы Казимира прошли в украинском селе. До 12 лет в Моевке \
		Ямпольского уезда Подольской губернии, затем в Пархомовке, Волчке, Белополье; далее до 17 лет он преимущественно оставался в Конотопе. \
		В 1895—1896 годах посещал Киевскую рисовальную школу Н. И. Мурашко, учась у Н. К. Пимоненко. В 1894—1895 годы Малевич жил в Конотопе. \
		По воспоминаниям самого художника (инициированным в 1933 году Николаем Харджиевым) первую картину в технике масляной живописи он написал в 16 лет \
		(по всей вероятности, в 1894 году). На картине под названием «Лунная ночь», размером аршин три четверти, была изображена река с лодкой на берегу \
		и отражающая лучами Луна. Работа понравилась друзьям Малевича. Один из друзей (по-видимому, конотопских) предложил продать картину и, не спросив художника, \
		отнёс её в магазин, где та была достаточно быстро куплена за 5 рублей. Местонахождение картины так и осталось неизвестным.",
		desktopImage: "img/catalog/malevich-desktop.jpg",
		tabletImage: "img/catalog/malevich-tablet.jpg",
		mobileImage: "img/catalog/malevich-mobile.jpg"
	},
	// belgium
	magritte: {
		name: "Рене Магритт",
		lifetime: "21 ноября 1898 — 15 августа 1967.",
		bio: "Рене Франсуа Гисле́н Магритт — бельгийский художник-сюрреалист. Известен как автор остроумных и вместе с тем поэтически загадочных картин. \
		Магритт работал художником плакатов и рекламы на фабрике бумажной продукции вплоть до 1926 года, когда контракт с брюссельской галереей Сенто \
		позволил ему полностью посвятить себя живописи. В 1926 году Магритт создаёт сюрреалистическую картину «Потерянный жокей», которую считал своей \
		первой удачной картиной такого рода. В 1927 году устраивает свою первую выставку, которую критики признают неудачной.",
		desktopImage: "img/catalog/magritte-desktop.jpg",
		tabletImage: "img/catalog/magritte-tablet.jpg",
		mobileImage: "img/catalog/magritte-mobile.jpg"
	}
}

function changeArtist(artistId) {
	$('.artists-catalog__link.selected').removeClass('selected')
	$('.artist-details').fadeOut(300, function() {
		artist = database[artistId];
		$(".artist-details__heading").text(artist.name);
		$(".artist-details__subtext").text(artist.lifetime);
		$(".artist-details__text").text(artist.bio);
		$('.artist-details__picture > source[media="(min-width: 1650px)"]').attr('srcset', artist.desktopImage);
		$('.artist-details__picture > source[media="(min-width: 768px)"]').attr('srcset', artist.tabletImage);
		$('.artist-details__img').attr('src', artist.mobileImage);
		$('#' + artistId).addClass('selected')
		$('.artist-details').fadeIn(300);
	});
}

$(function() {
	$(".artists-catalog__link").on("click", function() {
		artist_id = $(this).attr('id');
		changeArtist(artist_id);
	});
	$(".flags__button_france").on("click", function() {
		changeArtist('monet');
	});
	$(".flags__button_germany").on("click", function() {
		changeArtist('durer');
	});
	$(".flags__button_italy").on("click", function() {
		changeArtist('girlandaio');
	});
	$(".flags__button_russia").on("click", function() {
		changeArtist('aivazovsky');
	});
	$(".flags__button_belgium").on("click", function() {
		changeArtist('magritte');
	});
});
